app/controllers/saas_admin/pages_controller.rb

  def create
    @page = Page.new(params[:page])
    @page.position = (Page.maximum(:position) || 0) + 1
---
SELECT MAX(`pages`.`position`) AS max_id FROM `pages`
SELECT `pages`.* FROM `pages` ORDER BY position ASC, title ASC