app/controllers/blog_controller.rb

SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 1 ORDER BY position ASC, title ASC LIMIT 1
---
  def page
      @page = Page.find(params[:id])