app/controllers/content_controller.rb

  def about
    @page = Page.find(params[:id])
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 1 ORDER BY position ASC, title ASC LIMIT 1