app/controllers/pages_controller.rb

  def show
    @page = Page.find(params[:id])
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 0 ORDER BY position ASC, title ASC LIMIT 1