app/controllers/presessions_controller.rb

  def create
    @user = User.where(:email => params[:user][:email]).first

    if @user
      subdomain = @user.account.full_domain.split(".").first
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'vinitadeeran@gmail.com' LIMIT 1
SELECT `accounts`.* FROM `accounts` WHERE `accounts`.`full_domain` = 'localhost' AND (accounts.deleted_at IS NULL) LIMIT 1